---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
source: html/bca39b50-2696-744a-7aee-ceb733b9c902.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized

Defines parameters for parameterized rectangle structural section.

## Syntax (C#)
```csharp
public class StructuralSectionRectangleParameterized : StructuralSectionGeneralF
```